console.log('Im Working. Im JS. Im Beautiful. Im worth it');

let a = 221;
let b = a - 5;
a = 4
console.log(b, a);

/*
variable (변수)

정의 : 변경되거나 변경될 수 있는 것.
예시 : a = 5 이다. a = 221로 정정한다.
a는 빈 상자와 같다. 하나로 쓰이면 의미가 없지만 그 안에 무엇을 담느냐에 따라 우유상자가 될 수 있고 주스상자가 될 수도 있다.
우리는 빈 상자에 자유롭게 우유를 담기도, 주스를 담기도 한다.
이처럼 변경되거나 변경될 가능성이 있는 것. 이것을 변수라고 한다.

JS 변수 기본문법 :
1. 문법은 한 줄에 하나씩 서술한다.
2. 문법이 끝나면 ; 부호를 넣어준다.
3. 변수의 시작에 let을 넣는다. (변수의 종류가 두가지라 이를 구분하기 위해 사용한다.)

변수가 작용되는 순서 : 1.만든다. 2.초기화한다. 3.사용한다
필요할 때 1,2는 동시에 할 수 있다.

ex) a(1번) = 221(2번)
b = a(3번) - 5

24
*/